Repository: vaiiishnaviii123/StayFit
Catalog: lib/l10n/app_*.arb
Languages: es

source: Your Progress!
es: Su progreso!

source: Reward Points
es: Puntos de recompensa

# lastRecordedEvent
source: Last Event Recorded
es: Último evento registrado

# dedication
source: Dedication Level
es: Nivel de dedicación

# lastRecordedDate
source: Last Recorded on
es: Último grabado el

# noRecordMessage
source: Log your first record to earn points!
es: ¡Registra tu primer registro para ganar puntos!

source: Diet
es: Dieta

source: Workout
es: Ejercicio

source: Emotion
es: Emoción

# nextLevelMessage
source: Earn {fieldName} points to reach next level, hurry up!
es: Gana {fieldName} puntos para pasar al siguiente nivel, ¡date prisa!

source: Emotion Tracker
es: Rastreador de emociones

source: Diet Tracker
es: Rastreador de dieta

source: Workout Tracker
es: Rastreador de entrenamiento

source: Workout Type
es: Tipo de entrenamiento

source: Dish
es: Plato

# quanitity
source: Quantity
es: Cantidad

source: grams
es: gramos

source: Reps
es: cuenta

source: Save
es: Ahorrar

source: Delete
es: Borrar

source: Cancel
es: Cancelar

source: Material App
es: Material

# cupertino
source: Cupertino App
es: Cupertino

source: Stay Fit
es: Mantenerse en forma

source: Diet Record
es: Registro de dieta

# workoutRecord
source: Let's Workout
es: Registro de entrenamiento

source: Dish Name
es: Nombre del plato

source: Quantity in Grams
es: Cantidad en gramos

source: Enter Reps
es: Introduzca el recuento

# selectWorkout
source: Select a Workout
es: Ejercicio

source: on
es: el

source: Date
es: Fecha

# emoji1
source: You felt excited
es: Te sentiste emocionada

# emoji2
source: You had delicious food
es: Tuviste comida deliciosa

# emoji3
source: You are feeling loved
es: te sientes amado

# emoji4
source: You spent a day laughing out louder
es: riendo a carcajadas

# emoji5
source: You Feel blessed
es: Te sientes bendecida

# emoji6
source: Your day was pleasant
es: Tu dia fue agradable

# emoji7
source: You are proud of yourself
es: Estas orgullosa de ti misma

# emoji8
source: You felt welcomed
es: Te sentiste bienvenida

# emoji9
source: You are in mood of celebration
es: Estás de humor para celebrar.

# emoji10
source: You felt star struck
es: Te sentiste estrellado

# emoji11
source: You spent time thinking about something
es: Pasaste tiempo pensando en algo

# emoji12
source: You make smirking face
es: haces cara de sonrisa

# emoji13
source: You felt angry
es: Te sentiste enojada

# emoji14
source: You felt annoyed
es: Te sentiste molesta

# emoji15
source: You were speechless
es: Te quedaste sin palabras

# emoji16
source: You were sick
es: Estabas enferma

# emoji17
source: Having a headache
es: Tener dolor de cabeza

# emoji18
source: You felt sad
es: tener dolor de cabeza

# emoji19
source: You felt tensed
es: Te sentiste tensa

# emoji20
source: You felt bored
es: Te sentiste aburrida

# emoji21
source: You felt sleepy
es: Te sentiste somnoliento

# emoji22
source: You felt like crying
es: sentiste ganas de llorar

# emoji23
source: You felt weird
es: Te sentiste rara

# emoji24
source: You felt surprised
es: Te sentiste sorprendida

# emoji25
source: You got a mind blowing idea
es: Tienes una idea alucinante

# validDishName
source: Please enter a valid dish name.
es: Por favor ingresa un nombre de plato válido.

# validQuanitity
source: Please enter a valid positive number.
es: Por favor ingresa un número positivo válido.

# validReps
source: Please enter a valid positive non-decimal number.
es: Por favor ingrese un número no decimal positivo válido.

# notBlank
source: {fieldName} must not be blank
es: {fieldName} no se puede estar blanco
